docs/assets/uml/sequence.puml
@startuml

!if %variable_exists("$THEME")
title 阿里巴巴 COLA 应用架构时序图 - $THEME theme
!else
title 阿里巴巴 COLA 应用架构时序图
!endif

'skinparam BackgroundColor transparent

autonumber
participant "主动适配器" #SkyBlue
participant "eden-demo-cola-adapter" #LightGreen
participant "eden-demo-cola-app" #LightGreen
participant "eden-demo-cola-domain" #LightGreen
participant "eden-demo-cola-infrastructure" #LightGreen
participant "被动驱动器" #Pink
participant "扩展点" #Khaki

== 场景一：HTTP更新数据请求 ==

"主动适配器" -> "eden-demo-cola-adapter": 发送写请求报文
"eden-demo-cola-adapter" -> "eden-demo-cola-app": 适配器组装数据传输对象
"eden-demo-cola-app" -> "eden-demo-cola-app": CQRS 解析出命令参数
"eden-demo-cola-app" -> "扩展点": 根据指令调用扩展功能（可选项）
"eden-demo-cola-app" -> "eden-demo-cola-domain": 调用领域层
"eden-demo-cola-domain" -> "eden-demo-cola-infrastructure": 通过防腐层执行数据写操作
"eden-demo-cola-infrastructure" -> "被动驱动器": 调用底层组件进行写操作
"eden-demo-cola-infrastructure" --> "eden-demo-cola-app": 返回查询数据
"eden-demo-cola-app" --> "eden-demo-cola-adapter": 组装返回数据
"eden-demo-cola-adapter" --> "主动适配器": 响应报文

== 场景二：HTTP查询数据请求 ==

"主动适配器" -> "eden-demo-cola-adapter": 发送读请求报文
"eden-demo-cola-adapter" -> "eden-demo-cola-app": 适配器组装数据传输对象
"eden-demo-cola-app" -> "eden-demo-cola-app": CQRS 解析出查询参数
"eden-demo-cola-app" -> "eden-demo-cola-infrastructure": 执行数据读操作
"eden-demo-cola-infrastructure" -> "被动驱动器": 调用底层组件进行读操作
"eden-demo-cola-infrastructure" --> "eden-demo-cola-app": 返回查询数据
"eden-demo-cola-app" --> "eden-demo-cola-adapter": 组装返回数据
"eden-demo-cola-adapter" --> "主动适配器": 响应报文

== 场景三：MQ消息驱动/Job定时任务触发 ==

"主动适配器" -> "eden-demo-cola-adapter": 监听事件触发
"eden-demo-cola-adapter" -> "eden-demo-cola-app": CQRS 分发
alt 领域调用
	"eden-demo-cola-app" -> "eden-demo-cola-domain": 调用领域层
	"eden-demo-cola-domain" -> "eden-demo-cola-infrastructure": 通过防腐层执行数据写操作
	"eden-demo-cola-infrastructure" -> "被动驱动器": 调用底层组件进行写操作
	"eden-demo-cola-infrastructure" --> "eden-demo-cola-app": 返回更新结果
else 简单查询
	"eden-demo-cola-app" -> "eden-demo-cola-infrastructure": 执行数据读操作
	"eden-demo-cola-infrastructure" -> "被动驱动器": 调用底层组件进行读操作
	"eden-demo-cola-infrastructure" --> "eden-demo-cola-app": 返回查询数据
end
"eden-demo-cola-app" -> "eden-demo-cola-app": 内部处理（ACK确认/Status状态）
"eden-demo-cola-app" --> "eden-demo-cola-adapter": 处理结果上报
"eden-demo-cola-adapter" --> "主动适配器": 上报结果

@enduml
